ХМНПФ_Общее/Documents/уп_ПриостановкаВыплатОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПриостановкаВыплатОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыОперацийПриостановкаОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПриостановки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ПриостановкаВыплатОПС/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 03.11.2017 ШадринАВ // ОбработкаПроведения() // №1214
	// ХМНПФ 03.11.2017 ШадринАВ // Новая ХМ_ПолучитьСостояниеДоПриостановки() // №1214
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);

	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;

	Отказ = Проверка(Заголовок);
	// регистр СостоянияПС 
	ТекСостояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата-1,Новый Структура("ДоговорОПС",ДоговорОПС)).Состояние;
	Если ВидОперации = Перечисления.уп_ВидыОперацийПриостановкаОПС.ПриостановкаВыплат Тогда
		#Удаление
		Если ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод Тогда
		#КонецУдаления
		#Вставка
		// +ХМНПФ 03.11.2017 ШадринАВ // ОбработкаПроведения() // №1214		
		Если ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод ИЛИ ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ОбязательстваВыполнены Тогда
		// -ХМНПФ 03.11.2017 ШадринАВ // ОбработкаПроведения() // №1214
		#КонецВставки
			Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			Если  ТипПриостановки = 0 Тогда
				Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены;
			Иначе
				Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены;
			КонецЕсли;	
		Иначе
			Отказ = Истина;
			Сообщить("По договору ОПСу №"+ДоговорОПС.Код+" выплаты не могут быть приостановлены, т.к. счет не в выплатном периоде.")
		КонецЕсли;
	Иначе
		Если ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены или ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены Тогда
			Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			#Удаление
			Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод;
			#КонецУдаления
			#Вставка
			// +ХМНПФ 03.11.2017 ШадринАВ // ОбработкаПроведения() // №1214
			Движение.Состояние = ХМ_ПолучитьСостояниеДоПриостановки();
			// -ХМНПФ 03.11.2017 ШадринАВ // ОбработкаПроведения() // №1214
			#КонецВставки
		Иначе
			Отказ = Истина;
			Сообщить("По договору ОПСу №"+ДоговорОПС.Код+" выплаты не могут быть восстановлены, т.к. счет не приостановлен.")
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

// ХМНПФ 03.11.2017 ШадринАВ // Новая ХМ_ПолучитьСостояниеДоПриостановки() // №1214
Функция ХМ_ПолучитьСостояниеДоПриостановки()
	// - находим дату последней приостановки
	// - затем находим состояние перед приостановкой
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(СостоянияДоговораОПС.Период) КАК Период
		|ИЗ
		|	РегистрСведений.уп_СостоянияДоговораОПС КАК СостоянияДоговораОПС
		|ГДЕ
		|	СостоянияДоговораОПС.ДоговорОПС = &ДоговорОПС
		|	И СостоянияДоговораОПС.Период < &Дата
		|	И СостоянияДоговораОПС.Регистратор ССЫЛКА Документ.уп_ПриостановкаВыплатОПС
		|	И СостоянияДоговораОПС.Состояние В (ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговоровОПС.НачисленияПриостановлены))";
	
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СостояниеПередПриостановкой = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Выборка.Период-1,Новый Структура("ДоговорОПС",ДоговорОПС)).Состояние;
	Иначе
		ВызватьИсключение "Не найдена приостановка выплат!";
	КонецЕсли;
	Возврат СостояниеПередПриостановкой;
КонецФункции // ХМ_ПолучитьСостояниеДоПриостановки()
